#[test]

/*
/* Fill in the blank */
fn main() {
    let mut v = Vec::new();
    for n in __ {
       v.push(n);
    }

    assert_eq!(v.len(), 100);
}
*/

fn main() {
    let mut v = Vec::new();
    for n in 0..100 {
        v.push(n);
    }

    assert_eq!(v.len(), 100);
}


/*
0..100 створює діапазон чисел від 0 до 99 (100 елементів).
Цикл for проходить по кожному числу в діапазоні і додає його до вектора v за допомогою методу push.
assert_eq!(v.len(), 100) перевіряє, чи має вектор довжину 100, що є правильним, оскільки ми додали рівно 100 елементів.
*/